Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Dark Moon (KO>EN).tmx
Source language: ko
Languages: en

source: 네가 내 옷을 잡고 뒤로 당겨줬잖아.
en: ...when that ball almost hit me back at the field.

source: 아… 안돼.
en: n-no way.

source: 화끈-
en: flush

source: 자긴 이 세상에서 그 누구보다도-
en: ...she, more than anyone else in this world...

source: 미워하지 않아.
en: I don’t hate you guys.

source: 그래, 그럼-
en: great. then...

source: 노아, 넌 책 거꾸로 들었어.
en: you’re holding the book upside down, noa.

source: 수하야···!
en: sooha?

source: 쩌엉!
en: crash

source: 낮에 나와있는 건 처음 보는 것 같아.
en: I’ve never seen you out in the daylight.

source: 여긴 운동장.
en: this is the field.

source: 덕분에 무사해.
en: I’m safe, thanks to you.

source: 다들 걱정 마.{j}나만 믿어.
en: don’t worry. you can trust me.{j}

source: 하지만,
en: but...

source: 쳇···!
en: hmph!

source: 헬리는, 크리스가 떠난 이후로-
en: heli’s the only one...

source: 크리스가 아직 안에 있어요!!!
en: chris is still in there!!!

source: 으응··· 당연하지···
en: yeah... of course...

source: 자...
en: h-how...

source: 말했잖아.
en: I told you.

source: 괜찮아?
en: are you okay?

source: 텔레파시.
en: it’s telepathy.

source: 어···?{j}근데 다른 애들은?
en: huh? where’s everyone else?{j}

source: 나랑 같이 왔는데, 왜?
en: she’s with me. why do you ask?

source: 아저씨, 바닐라 산처럼 쌓아주세요!
en: we’ll have one dozen scoops of vanilla! pile it up, please!

source: 특히 나쁜 쪽으로는 말야.
en: especially in bad ways.

source: 괜히 우리랑 어울렸다간
en: she’ll just be in danger...

source: 랑또 · 혜니 + 키로
en: Rangddo · Hyeni+Kiro

source: 탓
en: leap

source: 어?{j}응!{j}자리도 시온 옆이야.
en: oh, yeah! I sit next to shion, too.

source: 고마워.
en: thank you.

source: 너 이 자식!{j}당장 수하한테서 떨어져!!!
en: how dare you! get away from her, now!!{j}

source: 한 번은 나한테 자기 목을 물어보라고 한 적도 있어.
en: he even asked me to try biting his neck.

source: 응?{j}응···
en: oh, yeah...{j}

source: 형들이 너무 안일했어.
en: you all let your guard down too easily.

source: 대화가 통할 것 같지가 않아.
en: there’s no point in trying to have a conversation with them.

source: 오면서 보니까 엄청 커다란 들개 무리가 있더라구.
en: I saw a group of huge stray dogs on the way.

source: 그러니까 너도 날 믿어줘야지.
en: you should do the same in return.

source: 훨씬 교양있고, 지적이고, 깔끔하고, 귀족적이고···
en: ...are far more sophisticated, intelligent, clean, classy, and--

source: 왜 다들 내 방에 모여서···
en: what are you all doing in my room?

source: 크리스의 복수를...하고 싶었거든.
en: I wanted to avenge chris.

source: 시온!
en: shion!

source: 칸이 매일 이렇게 귀여운 동물 사진을 보내줬어.
en: khan sent me cute animal pics like this every day.

source: 아까 운동장에서 공이 날아왔을 때,
en: for pulling me back...

source: 뭐···뭐지?!!!
en: what... what was that?!

source: 샥!
en: whiz

source: 특히 시온 너는 친화력이 좋으니까-
en: you’re great at making friends, shion.

source: 까···깜짝이야···!
en: t-that scared me...!

source: 어디 가는 길이야?
en: where are you headed to?

source: 내가 금방 표 사서 올게.
en: I’ll be right back with the tickets.

source: 미···미안해···갑자기 화내서 미안···
en: s-sorry for lashing out at you guys...

source: 배운 적은 있지만,
en: I’ve only ever heard about it.

source: 알아.{j}농담이야, 솔론.{j}난 널 믿어.
en: I know. I was joking, solon. I trust you.{j}

source: 아~.
en: aha...

source: 됐어!
en: forget it!

source: 내 목을 물어볼래?
en: wanna try biting my neck?

source: 특별히 허가를 받지 않으면, 빌리기 어려워.
en: so you need special permission to borrow it.

source: 꺄아아악~!!
en: woohoo!!!

source: 척!
en: swish

source: 늦어서 미안해.{j}더 일찍 왔어야 했는데.{j}걱정했어.
en: sorry I’m late. I should’ve come earlier. I was worried about you.{j}

source: 댕동-
en: dong

source: 고마워, 수하야 잘 쓸게.
en: thanks, sooha. we like it a lot.

source: 정말 헬리네 애들이
en: are heli and his friends...

source: 아니!
en: no, I take that back.

source: 넌 분명···그때···분명···
en: I swear, that day... you...

source: 그냥・・・ 너무・・・ 반가워서・・・
en: guess I got too excited...

source: 저기...
en: hey...

source: 지금은!{j}지금 우리는!{j}그러니까!
en: that’s not the case for us!! now... now we’re...{j}{j}

source: 아~.{j}왜 그런 이상한 소문이・・・
en: ugh... why are there such weird rumors going around about me?{j}

source: 우리가 보육원에서 도망친 날이야.
en: that’s the day we ran away from the orphanage.

source: 응.{j}다행히.
en: yes, fortunately.{j}

source: 가자, 얘들아.
en: let’s go, everyone.

source: 양보한 게 아니라.
en: I didn’t give it to her.

source: 수하는 무사한거야?
en: is she okay?

source: 아니, 아니!!
en: n-no!!!

source: 미안!
en: sorry!

source: 수하가 알고 그런것도 아니잖아.
en: it’s not like she said it knowing who we are.

source: 농담이야, 솔론.
en: I was joking, solon.

source: 응, 응.
en: yeah.

source: 귀엽다~
en: so cute!

source: 내가 너와 동족이 아니란 걸 알아서 한 말이었어?
en: ...was that because you knew I was not one of you?

source: 그게··· 그러니까···
en: you see... uh...

source: 헬리…
en: heli...

source: 나는··· 나는··· 이 세상에서-
en: I hate vampires...

source: 파악!!!
en: splat

source: 지금 널 데리고 도망쳐도 돼?
en: but for now, can I take you and run away?

source: ···엉?
en: what...?

source: 너 여기 앉아!
en: you sit here!

source: 어…?
en: huh...?

source: 왜냐하면, 난 다리를 절거든.
en: because I was born...

source: 나는… 난…
en: I-I...

source: 내가 너에게 심하게 비난을 하거나,
en: weren’t you afraid that I might blame you...

source: 후후후-
en: hehehe

source: 수하야!!!{j}기다려!!
en: sooha!!! wait!!{j}

source: 그게 무슨 말이야!!!
en: what are you talking about?!

source: 보육원이란 이름 하에
en: ...and practically grew up in confinement...

source: 헬리형!!!
en: heli!!

source: 괜찮아?!
en: are you okay?!

source: 서로 원수지간이잖아.
en: ...historically and innately.

source: 그런 얘긴 뭐하러해?!!
en: why would you tell her that?!

source: 지금 세줄이나 읽었거든?
en: excuse me, I read three sentences already!

source: 내가 데리러 갈게!
en: I’ll come get you!

source: 네가 우리에게 실망하는 게 더 두려워서…
en: ...than people finding out that we’re vampires.

source: 누가 좀···
en: anyone...

source: 자카!{j}노아!{j}너희까지?!!
en: jakah! noa! even you two?!{j}

source: 우리가 먼저 괜한 소릴 한 걸.
en: we started it, after all.

source: 공이 날아와서 놀랐나?
en: did we scare her off?

source: 뭐?!
en: what?!

source: 드셀리스 아카데미에서의 첫 등교인가···?
en: my first day of school at decelis academy!

source: 야!{j}네가 지금 지어낸 거지?!!
en: hey! you just made that up, didn’t you?!{j}

source: 정말 헬리가-
en: is heli...

source: 칸···?!
en: khan?

source: ···흥, 누가!
en: as if!

source: 수하가 더 무서워할지도 몰라···
en: ...I might scare her even more.

source: 뱀파이어는 아예 사랑이라는 감정도 없잖아.
en: but vampires don’t even feel emotions like love...

source: 그래.{j}우리가 놈들과 싸우려 할 때,
en: he’s right. when we were about to fight them...{j}

source: 그래.{j}막상 근처에 있으면 털 날릴 거야.
en: he’s right. they’ll shed all over you if you actually meet one.{j}

source: 너흰 보육원에서 함께 자랐다며?
en: you told me you grew up together at an orphanage.

source: 꿈···꿈인가···?!!
en: was that... a dream?

source: 그렇구나・・・
en: I see.

source: 아・・・ 그냥・・・ 그냥 옛날 이야기・・・
en: uhm... just... some old stories...

source: 나도 같이 가도 돼?
en: can I come too?

source: 내가 언제?
en: I never said that.

source: 우리만 예외라고 하면 그만이야?
en: no one would believe that we’re different.

source: 야!!!!
en: hey!!!

source: 반가워.
en: Hi.

source: 하지만, 지금은 아니야.
en: but not anymore.

source: 그래.{j}동족은 아냐・・・
en: yeah, she’s not one of us...{j}

source: 인사!
en: do it!

source: 왜 널 데려가려고 한건데?
en: why was he trying to take you?

source: 학교를 좀 더 둘러보고 싶어서・・・
en: ...wanted to look around the campus.

source: 수하 네가 즐겁다니 다행이다.
en: I’m glad you’re enjoying your time here.

source: 늑대인간?
en: werewolves?

source: 좋아
en: all right.

source: 스으으
en: slide

source: 그래도 괜히 아쉽네···
en: but it’s still a bummer.

source: 어디로···?
en: where to?

source: ···칸?!
en: khan?!

source: 그···근데 너무 어지러워···!!
en: ugh, I feel nauseous...!!

source: 수하야, 이제 수업 끝났는데.
en: sooha, classes are over now.

source: 전학생에게 친절하게 대하는 건,
en: I consider it our duty as humans...

source: 타앗
en: zoom

source: 혼자서 어딜 간 거야?!!
en: where did he go all by himself?!

source: 왜냐하면…
en: because...

source: 어?{j}아니, 다른 애들도···
en: oh, no. the others also--{j}

source: 그동안 다른 애들한테도 비밀이었다며.
en: ...you had kept it a secret, even from the other guys.

source: 왜 저녀석들한테 가는거야?
en: why are you going to them?

source: 잠깐!!!
en: no!

source: 그러지 않으면···
en: it was as if...

source: 대체 왜 이렇게 된건지・・・
en: I don’t know why things changed...

source: 우리가 단체로 사랑에 빠진 거야?!
en: have we all fallen in love?!

source: 정말 아무한테도 말한 적 없다고?
en: are you absolutely sure?

source: 주···주말에?
en: th-this weekend?

source: 근데···우리 둘만?
en: but... just the two of us?

source: …수하야, 괜찮아?
en: sooha, are you all right?

source: 그래봤자 늑대인간은 절반이 똥개인걸?
en: romantic or not, werewolves are mostly mutts.

source: 시온이 보트 표 사러갔지?!
en: shion left to buy boat tickets.

source: 정말 그 아이가 소문대로・・・
en: maybe the rumor about the girl is true...

source: 바닷가 구경도 하고!
en: ...and go to the beach!

source: 되려 걔만 위험해질걸.
en: ...will bring her nothing but trouble.

source: 아니...저...
en: wait... I...

source: 너···너희야말로 대체 뭐야!!
en: I-I should be the one asking that!!!

source: 빤-
en: stare

source: 파앙!!
en: pow

source: 늑대인간이 훨씬 더 나아.
en: ...without a doubt.

source: 파앗
en: da dun

source: 절레-
en: shake

source: 사아악
en: fade

source: 커억!!
en: ack!!

source: 이 초딩아!!
en: you’re so childish!

source: 매년 나이트볼 경기에서 두 학교가 우승을 다퉜다고 했지.
en: ...fighting every year for the nightball championship title?

source: 다들 첫 인상은 차가워보였는데・・・
en: they all looked cold at first...

source: 항상 받았던 냉대인데도, 매번 마음이 아프다・・・
en: even though I’m used to that, it still hurts.

source: 그렇구나.
en: I see.

source: 그래.{j}괜히 우리랑 어울렸다간
en: I agree. hanging out with us...

source: 으응···
en: yeah.

source: 야!!{j}너흰 선물 뭐 가져왔어?
en: hey! did any of you bring gifts?{j}

source: 그런 기분이야!!
en: that’s how I feel!!!

source: 아니야.
en: that’s not true.

source: 너희가 늑대인간이든,
en: ...whether that be werewolves...

source: 칸이…
en: khan’s...

source: ···단둘이?
en: just the two of you?

source: 청소 좋아~
en: I love cleaning!

source: 난… 나는…
en: I-I can’t...

source: 솔론 바보.
en: silly solon.

source: 어디서 온 거야?
en: where are you from?

source: 어···!
en: oh...!

source: 아, 이건가?
en: is it this?

source: 정말 센스있는 선물이다~!!
en: just what they needed!!

source: 바다 한가운데로 잘 찾아와보셔~!
en: good luck finding us on the water!

source: 뭐··· 뭘 봐!
en: w-what’re you looking at?!

source: 응, 응···
en: totally agree.

source: 너희한테는 먼지도 아깝지만...
en: you don’t even deserve dust...

source: 정말 고마워.
en: I really appreciate that.

source: 응, 헬리 오늘 고마웠어.
en: thanks for today, heli.

source: 소문으로는 뱀파이어의 소행이라는데···
en: rumors say it was done by a vampire.

source: 조심 좀 해!
en: you should be careful!

source: 아까 네 앞에서 싸우려고 해서.
en: for almost getting into a fight in front of you.

source: 뭐야···?
en: what?

source: 우물
en: nom

source: 또각
en: click

source: 응?{j}응···그래···
en: hm? sure... sounds good.{j}

source: 헉!
en: whoa!

source: 둥
en: da dun

source: 그래서 이곳에 전학온게 얼마나 기쁜지 몰라~!
en: that’s actually why I’m extremely excited to transfer here!

source: 나는 특히, 정말.
en: ... but I really,

source: 널 만난건 내 인생 최고의 행운이야.
en: meeting you was the best thing that happened in my life.

source: 드디어 내 방에 들어왔어!
en: I’m finally in my room!

source: 반가워!{j}너희가 와줘서 다들 기뻐할거야!
en: it’s so nice to see you all! I bet they’ll be happy that you came!{j}

source: 내 방 어질러지면 청소해야 하잖아!
en: cleaning up afterwards is too much work.

source: 야!
en: you!

source: 나의 목을 물어줘
en: Bite My Neck

source: 꿈인 게 당연하지.
en: of course it’s just a dream.

source: 지금 당장이 아니어도 괜찮아.
en: you don’t have to do it right now.

source: 주말에 보자.
en: ...I’ll see you on the weekend.

source: 헬리가 금방 온다니까 사지 말라고 해야겠다.
en: I should tell him not to since heli’s joining soon.

source: 그건 그래···
en: good point.

source: 우리 학교가-
en: our school...

source: 오늘 전학 왔다며?
en: You transferred here today, right?

source: 그러니까 내가 뱀파이어로 오해받을 일도 없어~!
en: so, I won’t get mistaken for a vampire either!

source: 어?{j}응!
en: oh, {j}yeah!

source: 여기 있었구나!
en: there you were!

source: 피잉-
en: bzzt

source: 요즘 나의 관심분야지.
en: I’ve found interest in it recently.

source: 하아-
en: huff

source: 엔지 형!
en: enzy!

source: 드디어 오늘이-
en: finally, this day has come...

source: 그럼 다다음 주에 보지 뭐!
en: we’ll see you the week after that, then!

source: 우린 우리뿐이야.
en: we’re the only ones.

source: 그때 승부를 내는 게 어때?
en: it’s coming up soon anyway.

source: 걔한테 능력까지 보여줬다고?!
en: showed her your abilities?

source: 내가 누구 때문에 죽었는지 잊었어?
en: did you forget who killed me?

source: 수하야!!!
en: sooha!!

source: 내가 전학 와서 어색할까 봐 신경 써주는 건가···?
en: is he worried that I might feel awkward being the new girl...?

source: 하마터면 네가 와줘서 기뻤다고 말할뻔 했네···!
en: I almost told him I was glad he came!

source: 어?{j}어?{j}내가?
en: uh... I do?{j}

source: 너희 실력이 겨우 이정도라니.
en: is this all you’ve got?

source: 지금 이 시간에, 이런 곳에서,
en: who could’ve expected these punks to show up...

source: 다들 앞으로-
en: all of you...

source: 시온!!!!
en: shion!!!

source: 크리스!!!!
en: chris!!!!

source: 수하야, 내가 들어줄게.{j}이리 줘.
en: here, let me take that for you.{j}

source: 수하야~~
en: sooha!

source: 그럼 우리 보트타러 갈래?
en: then why don’t we go on a boat?

source: 우리 일단 안으로 들어가자!
en: why don’t we go inside?

source: 그래, 좋아.
en: that sounds good.

source: 수하?!!!
en: sooha?!

source: 오늘처럼 보름달이 뜨는 날이 가까워지면···
en: ...on nights with the full moon like tonight.

source: 가서 뭐라고 할건데?
en: what are you going to tell her?

source: 우리야말로 잘 부탁해!
en: that’d be our pleasure!

source: 하지만 덕분에 확신하게 됐지.
en: but thanks to that experience, I’m convinced that...

source: 그런 짓을 어떻게 해!!!
en: how could I do such a thing?!

source: 스르륵-
en: loom

source: 더 일찍 왔어야 했는데.
en: I should’ve come earlier.

source: 만약 우리의 정체를 들켰다간
en: if people find out about us...

source: 퍼엉
en: boom

source: 처음・・・응?
en: huh?

source: 척-
en: reach

source: 이름이-?
en: your name?

source: 괜찮아?!!!
en: are you okay?!!!

source: 학교 바깥은 위험 할 수 있어요.
en: still, it may be dangerous outside of school.

source: 에이~
en: nah!

source: 끼룩
en: squawk

source: 그・・・그래.
en: oh... yes.

source: 미···미안!{j}급박해서!!
en: s-sorry! I was in a rush.{j}

source: 뭐?!!{j}이 자식이···!!
en: what did you little-?!

source: 수하야, 나한테 이런 능력이 있다는 건 비밀로 해줄 거지?
en: sooha, you’ll keep my ability a secret, right?

source: 타다다
en: dash

source: 지노형은 왜 불붙이는데!!
en: and why’d you start the fire, jino?!

source: 어디에 뒀어?{j}내가 찾아줄게!
en: where’d you put it? I’ll get it for you!{j}

source: 이 시간에?
en: in broad daylight?

source: 아, 응.
en: oh, sure.

source: 정말 그 외에는 누구에게도…
en: but other than him no--

source: 네가 수하구나?!
en: you must be sooha!

source: 인간이랑 친해진다니.
en: become friends with a human?

source: 수하 안녕~ 내일 봐~!!
en: bye, sooha! see you tomorrow!!!

source: 아···그게···
en: well... uh...

source: 물론 그런 충동이 없다고하면 거짓말이겠지만···
en: I’d be lying if I said we never feel the urge...

source: 랑또 | HENIE + KIRO
en: Rangddo | HENIE + KIRO

source: 영원히.
en: and they love her, and only her...

source: 어떻게 날 그렇게 쉽게 믿었던 건데?
en: ...how did you trust me so easily?

source: 선샤인시티스쿨에 다니는 그 녀석들?!!
en: the ones from sunshine city school?!

source: 우리한텐 최악의 욕이나 다름없거든.
en: that’s basically the worst thing you can say to insult us.

source: 응?{j}어떻게?
en: what do you mean?{j}

source: 24.{j}비밀 공유
en: 24. Sharing Secrets{j}

source: 무슨 일인지 연락해볼까?
en: should I ask him what he’s up to?

source: 충동적으로 잠옷을 입고 나와버렸네...
en: it was such a spur-of-the-moment decision that I came out in my pj’s...

source: 쏴아아아
en: swaaa

source: 자, 내 옆에 앉아!{j}수하야!
en: sooha, come sit here! right next to me!{j}

source: 어디야!!
en: where?!

source: 나··· 나는··· 너무 좋은데···
en: th-that... sounds like... fun...

source: 크리스는 뛸 수가 없다구요!!
en: he can’t run!

source: 보육원에서 도망쳐나온 이후로,
en: we’ve been keeping our identities from everyone...

source: 뭐?{j}말도 안 돼~ 전혀 아냐~
en: what? of course not. that’s ridiculous!

source: 월식은 흔하게 일어나는 게 아니니까,
en: ...lunar eclipses don’t happen very often...

source: 어!{j}맞아!{j}그런 기분이야!!
en: that’s it! that’s exactly how it is!!{j}

source: 우린 같은 보육원 출신이야.
en: we’re from the same orphanage.

source: 아무것도 먹고 싶지 않고,
en: ...other than blood.

source: 너희의 비밀을 학교에 말할까봐 두렵지 않았어?
en: ...or tell the school about your identity?

source: 번쩍-
en: swoosh

source: 싸우지 않을게.
en: we won’t fight.

source: 난 나자크라고 해.
en: I’m najak.

source: 뭐야, 그 표정!!
en: what’s with that face?!

source: 우리가 뱀파이어에게 물린건지,
en: so we’re not sure...

source: 오늘 너무 즐거웠어.
en: I had so much fun today.

source: 나자크 형까지 때려눕혔어?
en: you even defeated najak?

source: 와~ 책이 이렇게나・・・!!
en: wow! there are so many books!

source: 헬리야, 그만둬!!!
en: heli, stop!

source: 아기 늑대들이네~!!!
en: are these wolf pups?

source: 그보다 어떻게 이게 가능한 거지?
en: all that aside, how is...

source: 실제로 본 건 처음이야···
en: this is the first time seeing it with my own eyes.

source: ···그래.
en: yeah...

source: 아···아냐···!{j}자···잘자, 헬리야!
en: n-never mind! g-good night, heli!{j}

source: 다른 친구들은?
en: what about your friends?

source: 헬리야.
en: heli.

source: 넌 크리스가 아냐.
en: you’re not chris.

source: 네 옷에 먼지가 붙어서 떼준 거야!
en: I was just taking dust off your jacket!

source: 12.{j}꿈이어도 괜찮아
en: 12.{j}Even If It’s a Dream

source: 길게!
en: talk to us!

source: 제작
en: Production:

source: 이렇게 만나는건 오랜만이네.
en: ...but haven’t met in person in a while.

source: 사실...
en: in fact...

source: 응, 고마워.
en: yeah, I did!

source: 칸!!
en: khan!!

source: 헬리!!!
en: heli!!

source: 크리스!
en: chris!

source: 인간의 당연한 도리라고 생각해.
en: ...to be nice to a new student.

source: 꽈아악
en: squeeze

source: 대체 어떻게 전부 뱀파이어가 된 거야?
en: how’d you end up becoming vampires?

source: 시온아, 그만해.
en: that’s enough, shion.

source: 아···안에···
en: t-there’s...

source: 하지만 이젠 알아.
en: but now I know...

source: 없다고 하면 끝이야?
en: is that all you have to say?!

source: 아!!
en: oh!

source: 지금 우리는!
en: w-we are...

source: 늑대인간이랑 뱀파이어에 관한 내용도 있고.
en: apparently, there are stories about werewolves and vampires as well.

source: 정말 그렇게 생각해?!!
en: do you really think that?

source: 파악
en: flash

source: 제길!
en: damn it!

source: 잉?
en: huh?

source: 정말?{j}이대로 그냥 가는 거야?
en: are you serious? we’re just going to leave like this?{j}

source: 여기!!
en: here!

source: 당연하지!
en: of course!

source: 날 구하러 와줬구나.
en: you came to save me.

source: 들개인가?
en: are those stray dogs?

source: 네···네가 어떻게···
en: h-how are you alive...?!

source: 신기하다.
en: that’s so cool.

source: 이대로 그냥 가는 거야?
en: we’re just going back?

source: 내가 갖다 버려야겠다.
en: I should go throw them away.

source: 좋아···
en: sure.

source: 아참!{j}그러고보니 너 여기에 책 찾으러 왔다고 했지?
en: oh, right! you said you came to look for your book, right?{j}

source: 크아아악!!!
en: graaah!

source: 많이 놀랐지?
en: that must’ve scared you.

source: 헬리, 네가 와줘서···
en: thanks to you coming over--

source: 수하한테서 당장 떨어져.
en: step away from sooha, right now.

source: 컸고!{j}크고 있고(?)!
en: we’re grown! and are... g-growing!{j}

source: 저벅-
en: step

source: 크아악
en: roar

source: 자카!!!
en: jakah!!

source: 너 이 자식!
en: how dare you!

source: 그동안 문자로는 연락을 많이 했는데,
en: we kept in touch via text...

source: 꿈속에서 말했다고?
en: you told him about the secret?

source: 특히···
en: especially...

source: 크아악-!!!
en: aaargh!

source: 이···이 녀석 설마···!!
en: th-they’re...

source: 뭔가··· 설명할 수 없는···
en: I can’t explain it, but I feel...

source: 아~ 그렇구나.
en: oh, I see.

source: 내가···널!!{j}내가 널 얼마나···!!
en: you have absolutely no idea how much I’ve...!!{j}

source: 아니야!!!
en: absolutely not!!!

source: 나는 수하!
en: it’s sooha!

source: 나이트볼은 나이트볼 대로 박살을 내주지.
en: ...we look forward to crushing you in nightball.

source: 자, 물어봐
en: here, bite it.

source: 비교할 필요도 없어!
en: they’re not even worth comparing.

source: 우리한테 그런 감정이 어디있어?
en: we don’t have emotions like that.

source: 늑대인간은 바보 같아.
en: werewolves are idiots.

source: 대신 나랑 친하게 지내자.
en: how about you and I become friends instead?

source: 이사도 여러 번 다니고,
en: ...that you’ve bounced around different cities...

source: 내가.
en: I’ll...

source: 너무 슬프기도 해…
en: ...that I’ve become afraid of him.

source: 주말에 나랑 같이 놀러 갈래?
en: do you want to hang out with me this weekend?

source: 어···?{j}어···?!{j}너···, 지금!!
en: w-wait a minute!! did you just...{j}

source: 어?!!
en: huh?

source: 질질-
en: drag

source: 푸슈우우욱
en: flush

source: 어차피 죽을수도 없는걸.
en: not that I could die anyway.

source: 대공개!
en: and reveal!

source: 그냥 닮은 사람이었겠지···
en: it must’ve been someone who looked like him.

source: 아깐 갑자기 달려들어서 미안.
en: sorry for jumping at you.

source: 수하?
en: sooha?

source: 그동안은 매번 내 이상한 능력 때문에
en: people always thought I was a vampire...

source: 그 상자는···!!
en: that box is...!!

source: 무서워서···
en: ...scares me.

source: 다들 아무렇지 않게 대해주네···
en: ...but they’re all acting like it’s no big deal.

source: 내 생각엔 오히려 너희랑 관련이 있는 것 같은데?
en: it rather seems like it has something to do with you guys.

source: 손 시리면 얘기해.
en: tell me whenever your hands get cold.

source: 귀찮게 굴긴!
en: this is annoying.

source: 아・・・ 아냐!!{j}잠깐!!!{j}오해야!!
en: w-wait, hold on!! it’s not what you think!{j}

source: 솔론은 나를 싫어하는 것 같아・・・
en: he definitely hates me.

source: 인간들 입장에선 어차피 다 똑같은 뱀파이어인데.
en: to humans, all vampires are the same.

source: 믿기 어렵겠지만, 사실이야.
en: it may be hard to believe, but it’s true.

source: 야!{j}억지 부리지 마!!{j}이 초딩아!!
en: stop lying, you little brat!!{j}

source: 그래, 맞아.
en: that’s right.

source: 우두둑
en: crack

source: 거짓말이겠지만…
en: ...if I said I had no urge at all.

source: 저… 그리고 수하야.
en: and, uh... sooha.

source: 그런거 아니라고···!!
en: it’s nothing like that...!

source: 보나마나 다들,
en: but I’m sure...

source: 우리가 그쪽으로 가겠다고 전해줘.
en: tell him we’ll head over.

source: 자카.
en: jakah.

source: 지금 이 근처에-
en: there are...

source: 그리고 네 표정만 봐도 엄청 억울해보이는걸.
en: plus, I can tell just by how upset you look right now.

source: 알았어.
en: I will.

source: 실제로는 무섭잖아~.
en: they’re scary in real life!

source: 후욱
en: huff

source: ···크리스?
en: chris?

source: 정말 그렇게 생각해?
en: you really think that?

source: 태어나서 처음으로···
en: ...I’m enjoying school...

source: 저・・・저기・・・저기・・・
en: uhm... h-heli...?

source: 우리한테 실망하겠지?
en: ...she’d be disappointed, right?

source: 월식이 있던 날?
en: on the night of a lunar eclipse?

source: 다들 걔한테 자기 능력까지 다 보여줬으면서!
en: but no, you all just showed her your abilities!

source: 헬리 형···우린···
en: heli... we’re...

source: 뭐어어?!!{j}그게 무슨말이야!{j}싫어!!
en: what?! nonsense!! absolutely not!!{j}

source: 내가 어떻게 널 몰라보겠어!!!
en: there’s no way I wouldn’t recognize you.

source: 칸.
en: and khan.

source: 턱!!
en: leap

source: 다들 약속을 우습게 아는 개떡 같은 놈들이야.
en: how flaky of them, making plans and not showing up.

source: 뱀파이어 놈들의 학교가.
en: ...where those vampires are?

source: 우리도 우리 스스로를···.
en: we also don’t understand ourselves...

source: 나만 믿어.
en: you can trust me.

source: 뱀파이어가 아니야・・・!
en: ...not a vampire!

source: 내가 방 정리한다고 하니까
en: I also told them I’ll be cleaning my room today...

source: 뱀파이어는 그저 냉정하고 잔인한 괴물일뿐이야!
en: vampires are no more than cruel, cold-blooded monsters!

source: 자카!
en: jakah,

source: 난 그냥 단지···수하 네가···
en: I was just afraid that...

source: 투덜
en: grumble

source: 우린 어릴때부터 함께 자랐거든.
en: we grew up together.

source: 크리스를 구해야해요!!
en: I have to save chris!

source: 어?{j}새···생일이면 가야지···!
en: yeah, I wouldn’t miss your birthday...!{j}

source: 응···그래.
en: yeah, you too.

source: 나한테・・・
en: it’s been so long...

source: 잘 자.
en: sleep tight,

source: 타앗-
en: zoom

source: 우리가 그럴리가 없잖아.
en: there’s no way we would’ve done somehting like that.

source: 특히 너에게만큼은 말하고 싶지 않았어.
en: ...but we especially wanted to keep them from you.

source: 네가 무슨 상관이야?
en: why do you care?

source: 목에는 이빨자국이 나있었겠지.
en: ...and had bite marks on the neck.

source: 9.{j}수하에게 접근금지
en: 9. Stay Away From Sooha{j}

source: 헤···헬리야···
en: h-heli...

source: 헬리는 아무것도 안 했는데도···
en: ...even though heli hadn’t done anything...

source: 그래도 굳이 싸우고 싶다면,
en: but if you insist...

source: 뿌-
en: glum

source: 아, 저 방에 있나?
en: are they in there?

source: 응, 응.{j}알아.
en: yeah. I know.{j}

source: 그동안 정말 오해를 얼마나 많이 받았는지・・・
en: I was mistaken for a vampire countless times...

source: 푸슈우우
en: flop

source: 영원히~ 포레버~ 네버엔딩~
en: every single week, for the rest of our lives.

source: 절레 절레
en: shake shake

source: 시온이 가져가서 아직 안 돌려줬지?
en: shion hasn’t returned it to me yet.

source: 그래···
en: that’s right.

source: 수하 넌 늑대 좋아하니?!
en: do you like wolves, sooha?

source: 그 아이는 뭔가 달라・・・
en: ...there’s something different about her.

source: 흐으윽
en: weep

source: 널 구하기 위해서라면,
en: I didn’t mind being hated for the rest of my life...

source: 난 취미가 독서거든.
en: I love reading in my free time.

source: 바보구나, 솔론.
en: solon, you’re such a fool.

source: 난 5시라고 했는데?
en: I clearly told you to meet us at 5 PM.
